# 'brew tap'
tap "homebrew/cask"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
brew "argocd"
brew "autoconf"
brew "awscli"
brew "cowsay"
brew "exa"
brew "fzf"
brew "fzf"
brew "gettext"
brew "git"
brew "github/gh/gh"
brew "go"
brew "gpg"
brew "grafana"
brew "httpie"
brew "imagemagick"
brew "iperf"
brew "jq"
brew "k3d"
brew "libevent"
brew "mas"
brew "mas"
brew "mcrypt"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "openssl"
brew "packer"
brew "postgres"
brew "prometheus"
brew "pv"
brew "python3"
brew "readline"
brew "ripgrep"
brew "sqlite"
brew "starship"
brew "stern"
brew "stow"
brew "terraform"
brew "tmux"
brew "wget"
brew "wrk"
brew "zsh"

# 'brew install --cask'
cask "docker"
cask "drawio"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "slack"
cask "visual-studio-code"

# 'mas install'
# mas "Affinity Photo", id: 824183456
# mas "Spark Mail - Email by Readdle", id: 997102246
# mas "Xcode", id: 497799835
