# 'brew tap'
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
# brew "wrk"
brew "argocd"
brew "autoconf"
brew "awscli"
brew "gnupg"
brew "cmake"
brew "cowsay"
brew "exa"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "go"
brew "gpg"
brew "grafana"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "iperf"
brew "jq"
brew "k3d"
brew "libevent"
brew "mas"
brew "mas"
brew "mcrypt"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "openssl"
brew "packer"
brew "pandoc"
brew "postgres"
brew "prometheus"
brew "pv"
brew "python3"
brew "readline"
brew "redis"
brew "ripgrep"
brew "rust"
brew "sqlite"
brew "starship"
brew "stern"
brew "stow"
brew "terraform"
brew "tmux"
brew "wget"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# 'brew install --cask'
cask "discord"
cask "docker"
cask "drawio"
cask "google-chrome"
cask "slack"
cask "notion"
cask "vagrant"
cask "visual-studio-code"
cask "mactex"
cask "alacritty"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
