# 'brew tap'
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# CLI
brew "cowsay"
brew "exa"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "gpg"
brew "htop"
brew "httpie"
brew "jq"
brew "neovim"
brew "pv"
brew "tree"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "wget"
brew "coreutils"
brew "yq"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Coding
brew "autoconf"
brew "cmake"
brew "go"
brew "golangci-lint"
brew "gofumpt"
brew "node"
brew "nvm"
brew "postgres"
brew "python3"
brew "readline"
brew "redis"
brew "rust"
brew "sqlite"
brew "tree-sitter"
brew "llvm"
brew "pre-commit"

# Kubernetes
brew "argocd"
brew "grafana"
brew "kubectx"
brew "k3d"
brew "kube-linter"
brew "kubeval"
brew "kustomize"
brew "prometheus"
brew "stern"
brew "tanka"
brew "jsonnet"
brew "wrk"
brew "yamllint"
brew "grafana/grafana/cortextool"
brew "fluxcd/tap/flux"
brew "clusterctl"

# Terraform
brew "terraform"
brew "terraform-docs"
brew "tflint"

# Others
brew "awscli"
brew "gnupg"
brew "imagemagick"
brew "iperf"
brew "libevent"
brew "mas"
brew "msgpack"
brew "nmap"
brew "openssl"
brew "packer"
brew "pandoc"

# 'brew install --cask'
cask "alacritty"
cask "discord"
cask "drawio"
cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
cask "keybase"
cask "mactex"
cask "notion"
cask "rancher"
cask "slack"
cask "vagrant"
cask "visual-studio-code"
